Revit 2026 API

# GlazingTransmittanceColorType Enumeration

---

The enumerated type representing the permitted values for the asset property "GlazingTransmittanceColor" from the "Glazing" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum GlazingTransmittanceColorType
```
```vb
Public Enumeration GlazingTransmittanceColorType
```
```cpp
public enum class GlazingTransmittanceColorType
```
```fsharp
type GlazingTransmittanceColorType
```

| Member name | Value | Description |
| --- | --- | --- |
| Blue | 3 |  |
| Bluegreen | 4 |  |
| Bronze | 5 |  |
| Clear | 0 |  |
| Custom | 6 |  |
| Gray | 2 |  |
| Green | 1 |  |

#### Reference

Autodesk.Revit.DB.Visual Namespace